# Grouping Data with Pandas

- Using <code>groupby()</code> 
- More info on grouby in the [Docs](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.groupby.html)
- Datetime info can be found [here](http://pandas.pydata.org/pandas-docs/stable/timeseries.html)
- Data can be found [here](https://github.com/stevesimmons/PyData-PandasFromTheInside)

In [57]:
import pandas as pd
import numpy as np
import datetime

In [35]:
# import data
df = pd.read_csv('scores.csv')

# view the first 10 rows
df.head()

         Date         Venue Round             Team  G   B   F   A
0  1897-05-08  Brunswick St    R1          Fitzroy  6  13  49  16
1  1897-05-08  Brunswick St    R1          Carlton  2   4  16  49
2  1897-05-08    Corio Oval    R1          Geelong  3   6  24  47
3  1897-05-08    Corio Oval    R1         Essendon  7   5  47  24
4  1897-05-08     Lake Oval    R1  South Melbourne  3   9  27  44

The **groupby()** function essentialy groups data and allows you to apply function to that data.

Below, lets group by the team and get the total count of games each team played.

In [7]:
df.groupby('Team')['Team'].count()

Team
Adelaide             584
Brisbane Bears       222
Brisbane Lions       445
Carlton             2431
Collingwood         2469
Essendon            2395
Fitzroy             1928
Footscray           1431
Fremantle            483
GW Sydney             94
Geelong             2363
Gold Coast           116
Hawthorn            1912
Kangaroos            209
Melbourne           2336
North Melbourne     1694
Port Adelaide        446
Richmond            2190
South Melbourne     1570
St Kilda            2312
Sydney               793
University           126
West Coast           688
Western Bulldogs     443
Name: Team, dtype: int64

Grouping is useful for applying aggregate calculations on you data. e.g. Find the average number of goals scored by each team.

In [13]:
df.groupby(['Team'])['G'].mean()

Team
Adelaide            13.753425
Brisbane Bears      12.846847
Brisbane Lions      13.676404
Carlton             12.203209
Collingwood         12.349939
Essendon            12.382046
Fitzroy             10.945021
Footscray           11.499651
Fremantle           12.759834
GW Sydney           10.904255
Geelong             12.269996
Gold Coast          11.198276
Hawthorn            13.010983
Kangaroos           14.425837
Melbourne           11.557791
North Melbourne     12.390791
Port Adelaide       13.432735
Richmond            12.449772
South Melbourne     10.429936
St Kilda            10.974048
Sydney              14.060530
University           6.674603
West Coast          13.805233
Western Bulldogs    14.255079
Name: G, dtype: float64

You can groupby multiple levels. 

e.g. For each Venue, find the total number of games each Team played at that Venue.

In [15]:
df.groupby(['Venue', 'Team'])['Team'].count()

Venue            Team
Adelaide Oval    Adelaide             26
                 Brisbane Lions        2
                 Carlton               1
                 Collingwood           2
                 Essendon              2
                 Fremantle             4
                 GW Sydney             2
                 Geelong               3
                 Gold Coast            2
                 Hawthorn              4
                 Melbourne             4
                 North Melbourne       2
                 Port Adelaide        30
                 Richmond              4
                 St Kilda              5
                 Sydney                4
                 West Coast            3
                 Western Bulldogs      2
Albury           North Melbourne       1
                 South Melbourne       1
Arden St         Carlton              47
                 Collingwood          44
                 Essendon             48
                 Fitzroy              47
                 Footscray            50
                 Geelong              46
                 Hawthorn             47
                 Melbourne            50
                 North Melbourne     529
                 Richmond             49
                                    ...
Windy Hill       Richmond             57
                 South Melbourne      51
                 St Kilda             53
                 Sydney                8
                 West Coast            5
Yallourn         Footscray             1
                 St Kilda              1
Yarraville Oval  Carlton               1
                 Essendon              1
                 Fitzroy               1
                 Footscray             7
                 Hawthorn              1
                 Richmond              1
                 South Melbourne       1
                 St Kilda              1
York Park        Adelaide              5
                 Brisbane Lions        7
                 Fremantle            10
                 GW Sydney             1
                 Geelong               1
                 Gold Coast            3
                 Hawthorn             49
                 Kangaroos             2
                 North Melbourne       4
                 Port Adelaide         8
                 Richmond              1
                 St Kilda             10
                 Sydney                1
                 West Coast            7
                 Western Bulldogs      5
Name: Team, Length: 561, dtype: int64

### Grouping by Date

- You can group by **datetime** objects. 
- There are multiple ways to do this, I will show you 2.

- **Before** you start, you need to convert the Date into a **datetime** object

### Converting Dates into datetime objects

In [36]:
# Convert the date variable into a datetime object
df.Date = pd.to_datetime(df.Date)

df.head()

        Date         Venue Round             Team  G   B   F   A
0 1897-05-08  Brunswick St    R1          Fitzroy  6  13  49  16
1 1897-05-08  Brunswick St    R1          Carlton  2   4  16  49
2 1897-05-08    Corio Oval    R1          Geelong  3   6  24  47
3 1897-05-08    Corio Oval    R1         Essendon  7   5  47  24
4 1897-05-08     Lake Oval    R1  South Melbourne  3   9  27  44

In [39]:
# check that this worked

df['Date'][0]

Timestamp('1897-05-08 00:00:00')

### 1. Split the Date into Month, Year, Day

In [49]:
# now that you have a datetime object, 
# you can extract Month, Day and Year easily

df.Date[0].year  # 1987
df.Date[0].month # 5
df.Date[0].day   # 8

# now create new columns for with this info

df['year'] = df['Date'].dt.year
df['month'] = df['Date'].dt.month
df['day'] = df['Date'].dt.day

df.head()

,Date,Venue,Round,Team,G,B,F,A,year,month,day
0,1897-05-08,Brunswick St,R1,Fitzroy,6,13,49,16,1897,5,8
1,1897-05-08,Brunswick St,R1,Carlton,2,4,16,49,1897,5,8
2,1897-05-08,Corio Oval,R1,Geelong,3,6,24,47,1897,5,8
3,1897-05-08,Corio Oval,R1,Essendon,7,5,47,24,1897,5,8
4,1897-05-08,Lake Oval,R1,South Melbourne,3,9,27,44,1897,5,8

Now, you can use the new columns to group the data

e.g. FInd the number of Rounds played **each month** in **2014**

In [50]:
df.query('year == 2014').groupby('month')['Round'].count()

month
3    36
4    72
5    64
6    80
7    56
8    88
9    18
Name: Round, dtype: int64

### 2. Create a datetime index

- This mehtod is NOT ideal for THIS dataset because there are multiple games played on each day
- We will create some new data to work with

In [69]:
base = datetime.datetime.today()

# create a list of dates spanning 365 days
date_list = pd.date_range(base, periods=365).values

# Create a list of numeric values, spanning 365 values
score_list = list(np.random.randint(low=1, high=100, size=365))

# create empty dataframe
date_df = pd.DataFrame()

# append data
date_df['date'] = date_list
date_df['score'] = score_list

date_df.head()

                        date  score
0 2018-06-27 11:40:22.709474     20
1 2018-06-28 11:40:22.709474     48
2 2018-06-29 11:40:22.709474     29
3 2018-06-30 11:40:22.709474     74
4 2018-07-01 11:40:22.709474     78

### create datetime index

- For grouping to work, we need to create a datetime index from our date data

In [70]:
date_df.index = date_df['date']

date_df.head()

                                                 date  score
date
2018-06-27 11:40:22.709474 2018-06-27 11:40:22.709474     20
2018-06-28 11:40:22.709474 2018-06-28 11:40:22.709474     48
2018-06-29 11:40:22.709474 2018-06-29 11:40:22.709474     29
2018-06-30 11:40:22.709474 2018-06-30 11:40:22.709474     74
2018-07-01 11:40:22.709474 2018-07-01 11:40:22.709474     78

Find the average score for each month

In [71]:
date_df.groupby(pd.Grouper(freq='M'))['score'].mean()

date
2018-06-30    42.750000
2018-07-31    41.580645
2018-08-31    47.612903
2018-09-30    44.800000
2018-10-31    37.870968
2018-11-30    45.166667
2018-12-31    41.935484
2019-01-31    56.903226
2019-02-28    45.357143
2019-03-31    42.645161
2019-04-30    52.066667
2019-05-31    53.064516
2019-06-30    46.115385
Freq: M, Name: score, dtype: float64

**Another** way to do the same thing using <code>**resample()**</code>

In [73]:
date_df.resample('M')['score'].mean()

date
2018-06-30    42.750000
2018-07-31    41.580645
2018-08-31    47.612903
2018-09-30    44.800000
2018-10-31    37.870968
2018-11-30    45.166667
2018-12-31    41.935484
2019-01-31    56.903226
2019-02-28    45.357143
2019-03-31    42.645161
2019-04-30    52.066667
2019-05-31    53.064516
2019-06-30    46.115385
Freq: M, Name: score, dtype: float64